---
title: ParameterMapIterator
classe: Autodesk.Revit.DB.ParameterMapIterator
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# ParameterMapIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Object Current { get; }` | `parameterMapIterator.Current` | Object |
| `String Key { get; }` | `parameterMapIterator.Key` | String |
| `Boolean MoveNext()` | `parameterMapIterator.MoveNext()` | Boolean |
| `Void Reset()` | `parameterMapIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```